eaj40/TLE9879QXA40_eSL-BAS-EVALv1.0/1.3.0/TLE987x_FOC_BASIC_Sensorless_Example/RTE/TLE987x-eSL-BAS-EVAL/TLE9879QXA40/Ifx_MAS_ModulatorF16.h
/**
 *  \brief Set the modulator measurement time
 *
 *
 *  \param [inout] self Reference to structure that contains instance data members
 *  \param [in] measurementTime_tick Measurement time to be set, in number of ticks
 *
 */
static inline void Ifx_MAS_ModulatorF16_setMeasurementTime_tick(Ifx_MAS_ModulatorF16* self, uint16
                                                                measurementTime_tick)
{
    self->p_currentMeasurement.p_measurementTime_tick = (sint16)measurementTime_tick;
    Ifx_MAS_ModulatorF16_p_recalculateMinSenseTime(self);
    Ifx_MAS_ModulatorF16_p_recalculateDeltaEnd(self);
}


/**
 *  \brief Get the modulator measurement time
 *
 *
 *  \param [inout] self Reference to structure that contains instance data members
 *
 *  \return Modulator measurement time, in number of ticks
 */
static inline uint16 Ifx_MAS_ModulatorF16_getMeasurementTime_tick(Ifx_MAS_ModulatorF16* self)
{
    return (uint16)self->p_currentMeasurement.p_measurementTime_tick;
}


/**
 *  \brief Set the modulator period, which is the number of available ticks in one PWM period.
 *
 *  The period ticks are peripheral frequency/switching frequency.
 *
 *  \param [inout] self Reference to structure that contains instance data members
 *  \param [in] period_tick Period to be set, in number of ticks
 *
 */
static inline void Ifx_MAS_ModulatorF16_setPeriod_tick(Ifx_MAS_ModulatorF16* self, uint16 period_tick)
{
    self->p_period_tick = (sint16)period_tick;
}


/**
 *  \brief Get the modulator ringing time
 *
 *
 *  \param [inout] self Reference to structure that contains instance data members
 *
 *  \return Modulator ringingtime, in number of ticks
 */
static inline uint16 Ifx_MAS_ModulatorF16_getRingingTime_tick(Ifx_MAS_ModulatorF16* self)
{
    return (uint16)self->p_currentMeasurement.p_ringingTime_tick;
}


/**
 *  \brief Set the modulator ringing time
 *
 *
 *  \param [inout] self Reference to structure that contains instance data members
 *  \param [in] ringingTime_tick Ringing time to be set, in number of ticks
 *
 */
static inline void Ifx_MAS_ModulatorF16_setRingingTime_tick(Ifx_MAS_ModulatorF16* self, uint16 ringingTime_tick)
{
    self->p_currentMeasurement.p_ringingTime_tick = (sint16)ringingTime_tick;
    Ifx_MAS_ModulatorF16_p_recalculateMinSenseTime(self);
    Ifx_MAS_ModulatorF16_p_recalculateDeltaBegin(self);
}


#endif /*IFX_MAS_MODULATORF16_H*/
